{"pageProps":{"post":{"title":"Game On! | Let the Game Begin","excerpt":"An introduction to my new blog. Join me on my journey as I explore game design and development, share my experiences, and offer insights and resources to fellow gamers.","featuredImage":null,"author":{"name":"James Chaen Kwok","bio":"James is a junior at Virginia Tech studying Computer Science.","photo":null},"createdAt":"2023-03-07T04:05:52.167102+00:00","slug":"game-on-introduction","content":{"raw":{"children":[{"type":"paragraph","children":[{"text":"Welcome to \"Game On!\" - a blog about my journey to learn how to make video games. Growing up, I spent countless hours playing video games, from "},{"text":"Marvel: Ultimate Alliance 2 on the PS2","italic":true},{"text":" to "},{"text":"Pokémon Platinum","italic":true},{"text":" on the Nintendo DS, and then "},{"text":"League of Legends","italic":true},{"text":" and "},{"text":"CS:GO","italic":true},{"text":" on my PC. As I got older, my fascination with video games never waned, but I found myself trying to analyze and understand the intricacies and differences between games.  I began studying computer science in college, but it wasn't until recently that I decided to fully commit to learning the ins and outs of game development."}]},{"type":"paragraph","children":[{"text":"I was watching the anime "},{"text":"Overlord","italic":true},{"text":" with one of my friends and at the start of the show, the main character is playing Yggdrasil - a game where your brain is plugged into the console and you experience everything. I jokingly told my friend, \"Wouldn't it be cool to make something like that?\" But the thought was still there when I woke up the following day."}]},{"type":"paragraph","children":[{"text":"As I started to dig into game development, I decided to use Unreal Engine as my primary tool to learn. Unreal Engine is a powerful game engine that has been used to create some of the most popular games in gaming history, including the Batman: Arkham series, Fortnite, and Valorant. Part of the reason was that I'm choosing it is because I've dabbled with Blueprint, Unreal's visual scripting system in the past."}]},{"type":"paragraph","children":[{"text":"While I've worked with programming languages like Java, Python, and C before, I've never needed to learn C++. Since creating games using Unreal Engine is done with C++, this will be a great opportunity for me to dive deeper into the language and understand how it is different compared to what I know. I'm excited to expand my skill set and see it reflected in the projects I create. "}]},{"type":"paragraph","children":[{"text":"Through this blog, I aim to document my progress as I dive into the world of game design and development. I'll be sharing my experiences, challenges, and milestones along the way, as well as any resources and insights I discover. I hope to not only improve my skills but also inspire and encourage others who share my passion for gaming."}]},{"type":"paragraph","children":[{"text":"So whether you're a seasoned game developer, a curious gamer, or a newbie just like me, I invite you to join me on this exciting journey. Stay tuned for updates as I begin to explore and experiment with Unreal Engine and together, let's level up our skills and create something amazing!"}]}]}},"tags":[{"name":"Game Development","slug":"gamedev"},{"name":"Game On!","slug":"game-on"}]}},"__N_SSG":true}